w4d1/app/controllers/contact_shares_controller.rb

  def index
    @user = User.find(params[:user_id])
    @contacts_shares = ContactShare.all
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "contact_shares".* FROM "contact_shares"

  def show
    @contacts_share = ContactShare.find_by_id(params[:id])
---
SELECT  "contact_shares".* FROM "contact_shares" WHERE "contact_shares"."id" = $1 LIMIT 1  [["id", 1]]