w4d1/app/controllers/contacts_controller.rb

  def index
    @user = User.find(params[:user_id])
    @contacts = Contact.all
    if @user
      @contacts = Contact.where(user_id: @user.id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", nil]]
SELECT "contacts".* FROM "contacts"
SELECT "contacts".* FROM "contacts" WHERE "contacts"."user_id" = $1  [["user_id", 1]]

  def create
    contact = Contact.new(contact_params)
    if contact.save
---
INSERT INTO "contacts" ("name", "email", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Bob"], ["email", "bob@gmail.com"], ["user_id", 2], ["created_at", "2017-02-14 01:35:34.815281"], ["updated_at", "2017-02-14 01:35:34.815281"]]

  def show
    @contact = Contact.find_by_id(params[:id])
---
SELECT  "contacts".* FROM "contacts" WHERE "contacts"."id" = $1 LIMIT 1  [["id", 1]]