w4d1/app/controllers/users_controller.rb

  def update
    @user = User.find_by_id(params[:id])
    if @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 3]]
UPDATE "users" SET "name" = $1, "email" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["name", "Gizmo2"], ["email", "gizmo@gizmo.com"], ["updated_at", "2017-02-13 23:16:59.949075"], ["id", 3]]

  def destroy
    @user = User.find_by_id(params[:id])
    if @user.destroy
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 3]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 3]]