w6d3/app/controllers/users_controller.rb

SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
    if current_user.nil?
      # let them log in
      redirect_to new_session_url
      return
    end

    @user = User.includes(tweets: :mentioned_users).find(params[:id])

SELECT "users".* FROM "users"  WHERE (username ~ 'e')
---
  def search
    if params[:query].present?
      @users = User.where("username ~ ?", params[:query])