w7d2/backend/app/controllers/api/todos_controller.rb

  def show
    render json: Todo.find(params[:id])
---
SELECT  "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT 1  [["id", 0]]

  def create
    todo = Todo.new(todo_params)
    if todo.save
---
INSERT INTO "todos" ("title", "body", "done", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "talk to dog"], ["body", "woof"], ["done", "f"], ["created_at", "2017-03-07 19:36:47.579921"], ["updated_at", "2017-03-07 19:36:47.579921"]]

  def index
    render json: Todo.all.sort
---
SELECT "todos".* FROM "todos"

  def update
    todo = Todo.find(params[:id])
    if todo.update(todo_params)
---
SELECT  "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT 1  [["id", 3]]
UPDATE "todos" SET "title" = $1, "body" = $2, "done" = $3, "updated_at" = $4 WHERE "todos"."id" = $5  [["title", "Walk the Snake"], ["body", "ok"], ["done", "t"], ["updated_at", "2017-03-07 19:33:49.417568"], ["id", 3]]

  def destroy
    todo = Todo.find(params[:id])
    if todo.destroy
---
SELECT  "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT 1  [["id", 2]]
DELETE FROM "todos" WHERE "todos"."id" = $1  [["id", 2]]